In [1]:
import pandas as pd

In [2]:
data1 = [10,20,30,40]
ser = pd.Series(data1)          # series is a one dimensional array with single column but many data

In [3]:
ser

0    10
1    20
2    30
3    40
dtype: int64

In [4]:
type(ser)

pandas.core.series.Series

In [5]:
data2 = ["Atharv", "Akash", "Arjun"]
indx = ["one", "Two", "Three"]
ser1 = pd.Series(data2, index = indx)
ser1

one      Atharv
Two       Akash
Three     Arjun
dtype: object

In [6]:
ser1.describe()

count          3
unique         3
top       Atharv
freq           1
dtype: object

In [7]:
ser1.index

Index(['one', 'Two', 'Three'], dtype='object')

In [8]:
ser1.sort_index(axis = 0, ascending = True)

Three     Arjun
Two       Akash
one      Atharv
dtype: object

In [9]:
df = {
    "name": ["Abdul", "Akshay", "Rehman", "Joseph"],
    "age": [35,45,76,87],
    "city": ["Pune", "Mumbai", "New York", "Kolkata"]
}

data = pd.DataFrame(df)
data

     name  age      city
0   Abdul   35      Pune
1  Akshay   45    Mumbai
2  Rehman   76  New York
3  Joseph   87   Kolkata

In [10]:
l1 =  data.loc[0,"name"]
l1

'Abdul'

In [11]:
l2 = data.loc[[0,1,2] , ["name", "city"]]
l2

     name      city
0   Abdul      Pune
1  Akshay    Mumbai
2  Rehman  New York

In [12]:
l3 = data.iloc[0,2]
l3

'Pune'

In [13]:
data

     name  age      city
0   Abdul   35      Pune
1  Akshay   45    Mumbai
2  Rehman   76  New York
3  Joseph   87   Kolkata

In [14]:
datacopy = data.copy
datacopy

<bound method NDFrame.copy of      name  age      city
0   Abdul   35      Pune
1  Akshay   45    Mumbai
2  Rehman   76  New York
3  Joseph   87   Kolkata>

In [18]:
datadrop = data.drop(0)
datadrop

     name  age      city
1  Akshay   45    Mumbai
2  Rehman   76  New York
3  Joseph   87   Kolkata

In [19]:
dataloc = data.loc[[1,2], : ]                # [[row], [column]]
dataloc

     name  age      city
1  Akshay   45    Mumbai
2  Rehman   76  New York